In [1]:
# imports
import pandas as pd

In [2]:
# number formats in the output
pd.options.display.float_format = '{:,.2f}'.format

In [3]:
data_frame = pd.read_csv("salaries_by_college_major.csv")

# Preliminary Data Exploration and Data Cleaning with Pandas

In [4]:
# preview first 5 rows of our dataset
data_frame.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,"46,000.00","77,100.00","42,200.00","152,000.00",Business
1,Aerospace Engineering,"57,700.00","101,000.00","64,300.00","161,000.00",STEM
2,Agriculture,"42,600.00","71,900.00","36,300.00","150,000.00",Business
3,Anthropology,"36,800.00","61,500.00","33,800.00","138,000.00",HASS
4,Architecture,"41,600.00","76,800.00","50,600.00","136,000.00",Business

In [5]:
# preview last 5 rows of our dataset
data_frame.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
46,Psychology,"35,900.00","60,400.00","31,600.00","127,000.00",HASS
47,Religion,"34,100.00","52,000.00","29,700.00","96,400.00",HASS
48,Sociology,"36,500.00","58,200.00","30,700.00","118,000.00",HASS
49,Spanish,"34,000.00","53,100.00","31,000.00","96,400.00",HASS
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

In [6]:
# check the number of rows and columns of our dataset
data_frame.shape

(51, 6)

In [7]:
# check the columns
data_frame.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

In [8]:
# check for missing values and chunk data
# the isna() checks if a cell is a NaN. 
# NaN values are blank cells or cells that contain strings instead of numbers
data_frame.isna()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
5,False,False,False,False,False,False
6,False,False,False,False,False,False
7,False,False,False,False,False,False
8,False,False,False,False,False,False
9,False,False,False,False,False,False
10,False,False,False,False,False,False
11,False,False,False,False,False,False
12,False,False,False,False,False,False
13,False,False,False,False,False,False
14,False,False,False,False,False,False
15,False,False,False,False,False,False
16,False,False,False,False,False,False
17,False,False,False,False,False,False
18,False,False,False,False,False,False
19,False,False,False,False,False,False
20,False,False,False,False,False,False
21,False,False,False,False,False,False
22,False,False,False,False,False,False
23,False,False,False,False,False,False
24,False,False,False,False,False,False
25,False,False,False,False,False,False
26,False,False,False,False,False,False
27,False,False,False,False,False,False
28,False,False,False,False,False,False
29,False,False,False,False,False,False
30,False,False,False,False,False,False
31,False,False,False,False,False,False
32,False,False,False,False,False,False
33,False,False,False,False,False,False
34,False,False,False,False,False,False
35,False,False,False,False,False,False
36,False,False,False,False,False,False
37,False,False,False,False,False,False
38,False,False,False,False,False,False
39,False,False,False,False,False,False
40,False,False,False,False,False,False
41,False,False,False,False,False,False
42,False,False,False,False,False,False
43,False,False,False,False,False,False
44,False,False,False,False,False,False
45,False,False,False,False,False,False
46,False,False,False,False,False,False
47,False,False,False,False,False,False
48,False,False,False,False,False,False
49,False,False,False,False,False,False
50,False,True,True,True,True,True

In [9]:
# deleting the row that contains junk data / or not needed
# in our case we want to delete the last row
# we use dropna() on a new data_frame
clean_df = data_frame.dropna()
clean_df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,"40,800.00","78,200.00","41,200.00","168,000.00",HASS
46,Psychology,"35,900.00","60,400.00","31,600.00","127,000.00",HASS
47,Religion,"34,100.00","52,000.00","29,700.00","96,400.00",HASS
48,Sociology,"36,500.00","58,200.00","30,700.00","118,000.00",HASS
49,Spanish,"34,000.00","53,100.00","31,000.00","96,400.00",HASS

# Accessing Columns and Individual Cells in a Dataframe.

In [10]:
# find college major with the highest starting salary
starting_salaries = clean_df["Starting Median Salary"]
clean_df[starting_salaries == starting_salaries.max()]

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
43,Physician Assistant,"74,300.00","91,700.00","66,400.00","124,000.00",STEM

In [11]:
# method 2 | getting the row that has the largest starting salary on average
starting_salaries.max()

74300.0

In [12]:
# method 3 | using the idxmax() to get the index
starting_salaries.idxmax()

43

In [13]:
clean_df["Undergraduate Major"].loc[43]

'Physician Assistant'

In [14]:
clean_df["Undergraduate Major"][43] # another way of accessing a particular value

'Physician Assistant'

In [15]:
clean_df.loc[43] # retrieves data of the entire row

Undergraduate Major                  Physician Assistant
Starting Median Salary                         74,300.00
Mid-Career Median Salary                       91,700.00
Mid-Career 10th Percentile Salary              66,400.00
Mid-Career 90th Percentile Salary             124,000.00
Group                                               STEM
Name: 43, dtype: object

In [16]:
"""
Challenge

1. What college major has the highest mid-career salary? 
   How much do graduates with this major earn? (Mid-career is defined as having 10+ years of experience).

2. Which college major has the lowest starting salary and how much do graduates earn after university?

3. Which college major has the lowest mid-career salary and how much can people expect to earn with this degree? 
"""

'\nChallenge\n\n1. What college major has the highest mid-career salary? \n   How much do graduates with this major earn? (Mid-career is defined as having 10+ years of experience).\n\n2. Which college major has the lowest starting salary and how much do graduates earn after university?\n\n3. Which college major has the lowest mid-career salary and how much can people expect to earn with this degree? \n'

In [17]:
# college major having the highest mid-career salary
mid_career_salaries = clean_df["Mid-Career 10th Percentile Salary"]
mid_career_salaries.max()

71900.0

In [18]:
# find the index of the row containing the highest mid-career salary
mid_career_salaries.idxmax()

8

In [19]:
# locate the major
clean_df["Undergraduate Major"][8]

'Chemical Engineering'

In [20]:
# college major having the lowest starting salary
lowest_starting_salaries = clean_df["Starting Median Salary"]
lowest_starting_salaries.min()

34000.0

In [21]:
# find the index of the row containing the minimum starting salary
lowest_starting_salaries.idxmin()

49

In [22]:
# locate the major
clean_df["Undergraduate Major"][49]

'Spanish'

In [23]:
# Spanish graduates earn after university
clean_df["Mid-Career Median Salary"][49]

53100.0

In [24]:
# college major having the lowest-mid career salary
lowest_mid_career = clean_df["Mid-Career 10th Percentile Salary"]
lowest_mid_career.min()

26700.0

In [25]:
# find the index of the row containing the minimum starting salary
lowest_mid_career.idxmin()

39

In [26]:
# locate the major
clean_df["Undergraduate Major"][39]

'Music'

In [27]:
# Music major expected salary to earn
clean_df["Mid-Career 90th Percentile Salary"][39]

134000.0

# Sorting Values & Adding Columns: Majors with the Most Potential vs Lowest Risk

In [28]:
# calculate the difference between the earnings of the 10th and 90th percentile
# method 1
print( (clean_df["Mid-Career 90th Percentile Salary"] - clean_df["Mid-Career 10th Percentile Salary"]).head() )

0   109,800.00
1    96,700.00
2   113,700.00
3   104,200.00
4    85,400.00
dtype: float64

In [29]:
# method 2
difference_in_salaries = clean_df["Mid-Career 90th Percentile Salary"].subtract(clean_df["Mid-Career 10th Percentile Salary"])

In [30]:
# print the first 5 rows
difference_in_salaries.head()

0   109,800.00
1    96,700.00
2   113,700.00
3   104,200.00
4    85,400.00
dtype: float64

In [31]:
# add difference_in_salaries Series to our existing DataFrame
clean_df.insert(1, "spread", difference_in_salaries)

In [32]:
clean_df.head()

,Undergraduate Major,spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,"109,800.00","46,000.00","77,100.00","42,200.00","152,000.00",Business
1,Aerospace Engineering,"96,700.00","57,700.00","101,000.00","64,300.00","161,000.00",STEM
2,Agriculture,"113,700.00","42,600.00","71,900.00","36,300.00","150,000.00",Business
3,Anthropology,"104,200.00","36,800.00","61,500.00","33,800.00","138,000.00",HASS
4,Architecture,"85,400.00","41,600.00","76,800.00","50,600.00","136,000.00",Business

In [33]:
# Sorting by the Lowest Spread
lowest_risk = clean_df.sort_values("spread", ascending=False)

In [34]:
type(lowest_risk)

pandas.core.frame.DataFrame

In [35]:
# display the head() of the Undergraduate Major and the Spread
# to do this we pass a list of columns to the DataFrame

print( "Majors having the Lowest Spread:\n" )
print( lowest_risk[ ["Undergraduate Major", "spread"] ].tail() )

print( "\nMajors having the Greatest Spread:\n" )
print( lowest_risk[ ["Undergraduate Major", "spread"] ].head() )

Majors having the Lowest Spread:

           Undergraduate Major    spread
27  Health Care Administration 66,400.00
49                     Spanish 65,400.00
41                   Nutrition 65,300.00
43         Physician Assistant 57,600.00
40                     Nursing 50,700.00

Majors having the Greatest Spread:

   Undergraduate Major     spread
17           Economics 159,400.00
22             Finance 147,800.00
37                Math 137,800.00
36           Marketing 132,900.00
42          Philosophy 132,500.00

In [36]:
# Sorting by the Highest values in the 90th percentile
highest_values = clean_df.sort_values("Mid-Career 90th Percentile Salary", ascending=False)

In [37]:
highest_values[ ["Undergraduate Major", "Mid-Career 90th Percentile Salary"] ].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                         210,000.00
22               Finance                         195,000.00
8   Chemical Engineering                         194,000.00
37                  Math                         183,000.00
44               Physics                         178,000.00

In [38]:
# Sorting by the Highest values in the Mid-Career Median Salary
mid_career_salary = clean_df.sort_values("Mid-Career Median Salary", ascending=False)

In [39]:
# highest mid-career median salary
mid_career_salary[ ["Undergraduate Major", "Mid-Career Median Salary"] ].head()

       Undergraduate Major  Mid-Career Median Salary
8     Chemical Engineering                107,000.00
12    Computer Engineering                105,000.00
19  Electrical Engineering                103,000.00
1    Aerospace Engineering                101,000.00
17               Economics                 98,600.00

In [40]:
# Lowest mid-career median salary
mid_career_salary[ ["Undergraduate Major", "Mid-Career Median Salary"] ].tail()

   Undergraduate Major  Mid-Career Median Salary
39               Music                 55,000.00
32     Interior Design                 53,200.00
49             Spanish                 53,100.00
18           Education                 52,000.00
47            Religion                 52,000.00

In [41]:
# difference between the Largest and Lowest mid-career median salaries 
highest_mid_career_salary = mid_career_salary["Mid-Career Median Salary"].head()
lowest_mid_career_salary = mid_career_salary["Mid-Career Median Salary"].tail()

In [42]:
highest_mid_career_salary

8    107,000.00
12   105,000.00
19   103,000.00
1    101,000.00
17    98,600.00
Name: Mid-Career Median Salary, dtype: float64

In [43]:
lowest_mid_career_salary

39   55,000.00
32   53,200.00
49   53,100.00
18   52,000.00
47   52,000.00
Name: Mid-Career Median Salary, dtype: float64

In [44]:
type(highest_mid_career_salary)

pandas.core.series.Series

# Grouping and Pivoting Data with Pandas

In [45]:
"""
We have three categories in the 'Group' column: 
STEM, HASS and Business. 
Let's count how many majors we have in each category:
.groupby() method. This allows us to manipulate data similar to a Microsoft Excel Pivot Table.
"""
clean_df.groupby("Group").count()

,Undergraduate Major,spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,,
Business,12,12,12,12,12,12
HASS,22,22,22,22,22,22
STEM,16,16,16,16,16,16

In [46]:
type(clean_df.groupby("Group"))

pandas.core.groupby.generic.DataFrameGroupBy

In [47]:
# finding the average salary by group? 
clean_df.groupby("Group").mean()

,spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,"103,958.33","44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"95,218.18","37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"101,600.00","53,862.50","90,812.50","56,025.00","157,625.00"

# Learning Points & Summary

* Use .head(), .tail(), .shape and .columns to explore your DataFrame and find out the number of rows and columns as well as the column names.

* Look for NaN (not a number) values with .findna() and consider using .dropna() to clean up your DataFrame.

* You can access entire columns of a DataFrame using the square bracket notation: df['column name'] or df[['column name 1', 'column name 2', 'column name 3']]

* You can access individual cells in a DataFrame by chaining square brackets df['column name'][index] or using df['column name'].loc[index]

* The largest and smallest values, as well as their positions, can be found with methods like .max(), .min(), .idxmax() and .idxmin()

* You can sort the DataFrame with .sort_values() and add new columns with .insert()

* To create an Excel Style Pivot Table by grouping entries that belong to a particular category use the .groupby() method